src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/Scan_СоставляющиеРасчетаЦеныПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоставляющиеРасчетаЦеныПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИтоговыеЦены</name>
      <description>Итоговые цены</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаДилера</name>
      <description>Коэффициенты для цены на дилера</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаКлиента</name>
      <description>Коэффициенты для цены на клиента</description>
    </items>
    <items>
      <name>НерасчетныеСоставляющие</name>
      <description>Нерасчетные составляющие</description>
    </items>
    <items>
      <name>РасчетныеСоставляющие</name>
      <description>Расчетные составляющие</description>
    </items>
    <items>
      <name>СкидкиНаценки</name>
      <description>Скидки, наценки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВариантФормированияРасчета</name>
    <type>
      <types>EnumRef.Scan_ВариантыФормированияРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВКалькуляцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиКалькуляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимость</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыСоставляющихРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяПакетомУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииПакетаУслуг</name>
    <attributes>
      <name>БазоваяОпция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточнениеЗначенийПоУмолчанию</name>
    <attributes>
      <name>ИдентификаторПрайсЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/Scan_РедактированиеФормулыРасчетаСоставляющей/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Формула                  = Параметры.Формула;
	НаименованиеСоставляющей = Параметры.НаименованиеСоставляющей;
	Составляющая             = Параметры.Составляющая;
	
	Заголовок = НСтр("ru = 'Редактирование формулы расчета составляющей (%1)'; en = 'Editing component formula (%1)'");
	Если ПустаяСтрока(НаименованиеСоставляющей) Тогда
		Заголовок = СтрЗаменить(Заголовок, "(%1)", "");
	КонецЕсли;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, НаименованиеСоставляющей);
	
	// Ограничиваем выбор недоступных показателей.
	Если Параметры.НедоступныеСоставляющие <> Неопределено Тогда
		НедоступныеСоставляющие = Новый ФиксированныйМассив(Параметры.НедоступныеСоставляющие);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Составляющие, "Ссылка", НедоступныеСоставляющие, ВидСравненияКомпоновкиДанных.НеВСписке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекстВПозициюКурсора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Показатели" И Источник = ЭтаФорма Тогда
		Элементы.Показатели.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСоставляющие

&НаКлиенте
Процедура СоставляющиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Составляющие.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВФормулу(Элементы.Составляющие.ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляющиеНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элементы.Составляющие.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = Элементы.Составляющие.ТекущиеДанные.Идентификатор;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	
	ОчиститьСообщения();
	Результаты = РезультатыРедактирования(Формула, Составляющая, НедоступныеСоставляющие, Ложь);
	Если Результаты <> Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Проверка формулы завершена успешно.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСоставляющуюВФормулу(Команда)
	
	Если Элементы.Составляющие.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВФормулу(Элементы.Составляющие.ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоставляющую(Команда)
	
	Если Элементы.Составляющие.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.Составляющие.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект.ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОчиститьСообщения();
	Результаты = РезультатыРедактирования(Формула, Составляющая, НедоступныеСоставляющие);
	Если Результаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть(Результаты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатыРедактирования(Формула, ВидРасчета, НедоступныеСоставляющие, ДополнятьРезультаты = Истина)
	
	Результаты = Новый Структура;
	Результаты.Вставить("Формула", Формула);
	
	ПараметрыВыполненияФормулы =  Scan_ЦенообразованиеСервер.ПараметрыВыполненияФормулы(Формула, Истина, НедоступныеСоставляющие);
	
	Если ПараметрыВыполненияФормулы = Неопределено Тогда
		Возврат Неопределено
	Иначе
		СоставляющиеФормулы = ПараметрыВыполненияФормулы.СоставляющиеФормулы;
		
		Возврат Результаты;
	КонецЕсли;
	
КонецФункции   

&НаКлиенте
Процедура ДобавитьВФормулу(Идентификатор)
	
	УстановитьТекстВПозициюКурсора(Идентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстВПозициюКурсора(Текст = "")
	
	НачальнаяСтрокаВыделения = 0; 
	НачальнаяКолонкаВыделения = 0; 
	КонечнаяСтрокаВыделения = 0; 
	КонечнаяКолонкаВыделения = 0;
	
	// Получим текущую позицию курсора.
	Элементы.Формула.ПолучитьГраницыВыделения(НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения, КонечнаяСтрокаВыделения, КонечнаяКолонкаВыделения);
	
	Если ПустаяСтрока(Текст) Тогда
		НачальнаяКолонкаВыделения = НачальнаяКолонкаВыделения + СтрДлина(Формула);
	Иначе
		Элементы.Формула.ВыделенныйТекст = Текст;
		Модифицированность = Истина;
		
		// Установим курсор после вставленного текста.
		НачальнаяКолонкаВыделения = НачальнаяКолонкаВыделения + СтрДлина(Текст);
	КонецЕсли;
	
	Элементы.Формула.УстановитьГраницыВыделения(НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения, НачальнаяСтрокаВыделения, НачальнаяКолонкаВыделения);
	
КонецПроцедуры

#КонецОбласти
